Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: قالوا إن يسرق فقد سرق أخ له من قبل فأسرها يوسف في نفسه ولم يبدها لهم قال أنتم شر مكانا والله أعلم بما تصفون
en: They [(Yusuf's (Joseph) brothers] said: "If he steals, there was a brother of his [Yusuf (Joseph)] who did steal before (him)." But these things did Yusuf (Joseph) keep in himself, revealing not the secrets to them. He said (within himself): "You are in worst case, and Allah is the Best Knower of that which you describe!"

source: قالوا يا أيها العزيز إن له أبا شيخا كبيرا فخذ أحدنا مكانه إنا نراك من المحسنين
en: They said: "O ruler of the land! Verily, he has an old father (who will grieve for him); so take one of us in his place. Indeed we think that you are one of the Muhsinun (good-doers - see the footnote of V.9:120)."

source: قال معاذ الله أن نأخذ إلا من وجدنا متاعنا عنده إنا إذا لظالمون
en: He said: "Allah forbid, that we should take anyone but him with whom we found our property. Indeed (if we did so), we should be Zalimun (wrong-doers)."

source: فلما استيأسوا منه خلصوا نجيا قال كبيرهم ألم تعلموا أن أباكم قد أخذ عليكم موثقا من الله ومن قبل ما فرطتم في يوسف فلن أبرح الأرض حتى يأذن لي أبي أو يحكم الله لي وهو خير الحاكمين
en: So, when they despaired of him, they held a conference in private. The eldest among them said: "Know you not that your father did take an oath from you in Allah's Name, and before this you did fail in your duty with Yusuf (Joseph)? Therefore I will not leave this land until my father permits me, or Allah decides my case (by releasing Benjamin) and He is the Best of the judges.

source: ارجعوا إلى أبيكم فقولوا يا أبانا إن ابنك سرق وما شهدنا إلا بما علمنا وما كنا للغيب حافظين
en: "Return to your father and say, 'O our father! Verily, your son (Benjamin) has stolen, and we testify not except according to what we know, and we could not know the Unseen!

source: واسأل القرية التي كنا فيها والعير التي أقبلنا فيها وإنا لصادقون
en: "And ask (the people of) the town where we have been, and the caravan in which we returned; and indeed we are telling the truth."

source: قال بل سولت لكم أنفسكم أمرا فصبر جميل عسى الله أن يأتيني بهم جميعا إنه هو العليم الحكيم
en: He [Ya'qub (Jacob)] said: "Nay, but your ownselves have beguiled you into something. So patience is most fitting (for me). May be Allah will bring them (back) all to me. Truly He! Only He is All-Knowing, All-Wise."

source: وتولى عنهم وقال يا أسفى على يوسف وابيضت عيناه من الحزن فهو كظيم
en: And he turned away from them and said: "Alas, my grief for Yusuf (Joseph)!" And he lost his sight because of the sorrow that he was suppressing.

source: قالوا تالله تفتأ تذكر يوسف حتى تكون حرضا أو تكون من الهالكين
en: They said: "By Allah! You will never cease remembering Yusuf (Joseph) until you become weak with old age, or until you be of the dead."

source: قال إنما أشكو بثي وحزني إلى الله وأعلم من الله ما لا تعلمون
en: He said: "I only complain of my grief and sorrow to Allah, and I know from Allah that which you know not.

source: يا بني اذهبوا فتحسسوا من يوسف وأخيه ولا تيأسوا من روح الله إنه لا ييأس من روح الله إلا القوم الكافرون
en: "O my sons! Go you and enquire about Yusuf (Joseph) and his brother, and never give up hope of Allah's Mercy. Certainly no one despairs of Allah's Mercy, except the people who disbelieve."

source: فلما دخلوا عليه قالوا يا أيها العزيز مسنا وأهلنا الضر وجئنا ببضاعة مزجاة فأوف لنا الكيل وتصدق علينا إن الله يجزي المتصدقين
en: Then, when they entered unto him [Yusuf (Joseph)], they said: "O ruler of the land! A hard time has hit us and our family, and we have brought but poor capital, so pay us full measure and be charitable to us. Truly, Allah does reward the charitable."

source: قال هل علمتم ما فعلتم بيوسف وأخيه إذ أنتم جاهلون
en: He said: "Do you know what you did with Yusuf (Joseph) and his brother, when you were ignorant?"

source: قالوا أإنك لأنت يوسف قال أنا يوسف وهذا أخي قد من الله علينا إنه من يتق ويصبر فإن الله لا يضيع أجر المحسنين
en: They said: "Are you indeed Yusuf (Joseph)?" He said: "I am Yusuf (Joseph), and this is my brother (Benjamin). Allah has indeed been gracious to us. Verily, he who fears Allah with obedience to Him (by abstaining from sins and evil deeds, and by performing righteous good deeds), and is patient, then surely, Allah makes not the reward of the Muhsinun (good-doers - see V.2:112) to be lost."

source: قالوا تالله لقد آثرك الله علينا وإن كنا لخاطئين
en: They said: "By Allah! Indeed Allah has preferred you above us, and we certainly have been sinners."

source: قال لا تثريب عليكم اليوم يغفر الله لكم وهو أرحم الراحمين
en: He said: "No reproach on you this day; may Allah forgive you, and He is the Most Merciful of those who show mercy!

source: اذهبوا بقميصي هذا فألقوه على وجه أبي يأت بصيرا وأتوني بأهلكم أجمعين
en: "Go with this shirt of mine, and cast it over the face of my father, he will become clear-sighted, and bring me all your family."

source: ولما فصلت العير قال أبوهم إني لأجد ريح يوسف لولا أن تفندون
en: And when the caravan departed, their father said: "I do indeed feel the smell of Yusuf (Joseph), if only you think me not a dotard (a person who has weakness of mind because of old age)."

source: قالوا تالله إنك لفي ضلالك القديم
en: They said: "By Allah! Certainly, you are in your old error."

source: فلما أن جاء البشير ألقاه على وجهه فارتد بصيرا قال ألم أقل لكم إني أعلم من الله ما لا تعلمون
en: Then, when the bearer of the glad tidings arrived, he cast it (the shirt) over his face, and he became clear-sighted. He said: "Did I not say to you, 'I know from Allah that which you know not.'"

source: قالوا يا أبانا استغفر لنا ذنوبنا إنا كنا خاطئين
en: They said: "O our father! Ask Forgiveness (from Allah) for our sins, indeed we have been sinners."

source: قال سوف أستغفر لكم ربي إنه هو الغفور الرحيم
en: He said: "I will ask my Lord for forgiveness for you, verily He! Only He is the Oft-Forgiving, the Most Merciful."

source: فلما دخلوا على يوسف آوى إليه أبويه وقال ادخلوا مصر إن شاء الله آمنين
en: Then, when they came in before Yusuf (Joseph), he took his parents to himself and said: "Enter Egypt, if Allah wills, in security."

source: ورفع أبويه على العرش وخروا له سجدا وقال يا أبت هذا تأويل رؤياي من قبل قد جعلها ربي حقا وقد أحسن بي إذ أخرجني من السجن وجاء بكم من البدو من بعد أن نزغ الشيطان بيني وبين إخوتي إن ربي لطيف لما يشاء إنه هو العليم الحكيم
en: And he raised his parents to the throne and they fell down before him prostrate. And he said: "O my father! This is the interpretation of my dream aforetime! My Lord has made it come true! He was indeed good to me, when He took me out of the prison, and brought you (all here) out of the bedouin-life, after Shaitan (Satan) had sown enmity between me and my brothers. Certainly, my Lord is the Most Courteous and Kind unto whom He wills. Truly He! Only He is the All-Knowing, the All-Wise.

source: رب قد آتيتني من الملك وعلمتني من تأويل الأحاديث فاطر السماوات والأرض أنت وليي في الدنيا والآخرة توفني مسلما وألحقني بالصالحين
en: "My Lord! You have indeed bestowed on me of the sovereignty, and taught me something of the interpretation of dreams - the (Only) Creator of the heavens and the earth! You are my Wali (Protector, Helper, Supporter, Guardian, God, Lord.) in this world and in the Hereafter. Cause me to die as a Muslim (the one submitting to Your Will), and join me with the righteous."

source: ذلك من أنباء الغيب نوحيه إليك وما كنت لديهم إذ أجمعوا أمرهم وهم يمكرون
en: That is of the news of the Ghaib (Unseen) which We reveal to you (O Muhammad صلى الله عليه و سلم). You were not (present) with them when they arranged their plan together, and (while) they were plotting.

source: وما أكثر الناس ولو حرصت بمؤمنين
en: And most of mankind will not believe even if you desire it eagerly.

source: وما تسألهم عليه من أجر إن هو إلا ذكر للعالمين
en: And no reward you (O Muhammad صلى الله عليه و سلم) ask of them (those who deny your Prophethood) for it; it (the Qur'an) is no less than a Reminder and an advice unto the 'Alamin (men and jinn).

source: وكأين من آية في السماوات والأرض يمرون عليها وهم عنها معرضون
en: And how many a sign in the heavens and the earth they pass by, while they are averse therefrom.

source: وما يؤمن أكثرهم بالله إلا وهم مشركون
en: And most of them believe not in Allah except that they attribute partners unto Him [i.e. they are Mushrikun i.e. polytheists. See Verse 6: 121].

source: أفأمنوا أن تأتيهم غاشية من عذاب الله أو تأتيهم الساعة بغتة وهم لا يشعرون
en: Do they then feel secure from the coming against them of the covering veil of the Torment of Allah, or of the coming against them of the (Final) Hour, all of a sudden while they perceive not?

source: قل هذه سبيلي أدعو إلى الله على بصيرة أنا ومن اتبعني وسبحان الله وما أنا من المشركين
en: Say (O Muhammad صلى الله عليه و سلم): "This is my way; I invite unto Allah (i.e. to the Oneness of Allah - Islamic Monotheism) with sure knowledge, I and whosoever follows me (also must invite others to Allah i.e. to the Oneness of Allah - Islamic Monotheism with sure knowledge). And Glorified and Exalted be Allah (above all that they associate as partners with Him). And I am not of the Mushrikun (polytheists, pagans, idolaters and disbelievers in the Oneness of Allah; those who worship others along with Allah or set up rivals or partners to Allah)."

source: وما أرسلنا من قبلك إلا رجالا نوحي إليهم من أهل القرى أفلم يسيروا في الأرض فينظروا كيف كان عاقبة الذين من قبلهم ولدار الآخرة خير للذين اتقوا أفلا تعقلون
en: And We sent not before you (as Messengers) any but men unto whom We revealed, from among the people of the townships. Have they not travelled in the land and seen what was the end of those who were before them? And verily, the home of the Hereafter is the best for those who fear Allah and obey Him (by abstaining from sins and evil deeds, and by performing righteous good deeds). Do you not then understand?

source: حتى إذا استيأس الرسل وظنوا أنهم قد كذبوا جاءهم نصرنا فنجي من نشاء ولا يرد بأسنا عن القوم المجرمين
en: (They were reprieved) until, when the Messengers gave up hope and thought that they were denied (by their people), then came to them Our Help, and whomsoever We willed were rescued. And Our punishment cannot be warded off from the people who are Mujrimun (criminals, sinners, disbelievers, polytheists).

source: لقد كان في قصصهم عبرة لأولي الألباب ما كان حديثا يفترى ولكن تصديق الذي بين يديه وتفصيل كل شيء وهدى ورحمة لقوم يؤمنون
en: Indeed in their stories, there is a lesson for men of understanding. It (the Qur'an) is not a forged statement but a confirmation of (Allah's existing Books) which were before it [i.e. the Taurat (Torah), the Injeel (Gospel) and other Scriptures of Allah] and a detailed explanation of everything and a guide and a Mercy for the people who believe.

source: المر تلك آيات الكتاب والذي أنزل إليك من ربك الحق ولكن أكثر الناس لا يؤمنون
en: Alif-Lam-Mim-Ra. [These letters are one of the miracles of the Qur'an; and none but Allah (Alone) knows their meanings]. These are the Verses of the Book (the Qur'an), and that which has been revealed unto you (Muhammad صلى الله عليه و سلم) from your Lord is the truth, but most men believe not.

source: الله الذي رفع السماوات بغير عمد ترونها ثم استوى على العرش وسخر الشمس والقمر كل يجري لأجل مسمى يدبر الأمر يفصل الآيات لعلكم بلقاء ربكم توقنون
en: Allah is He Who raised the heavens without any pillars that you can see. Then, He rose above (Istawa) the Throne (really in a manner that suits His Majesty). He has subjected the sun and the moon (to continue going round), each running (its course) for a term appointed. He manages and regulates all affairs; He explains the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) in detail, that you may believe with certainty in the meeting with your Lord.

source: وهو الذي مد الأرض وجعل فيها رواسي وأنهارا ومن كل الثمرات جعل فيها زوجين اثنين يغشي الليل النهار إن في ذلك لآيات لقوم يتفكرون
en: And it is He Who spread out the earth, and placed therein firm mountains and rivers and of every kind of fruits He made Zawjain Ithnain (two in pairs - may mean two kinds or it may mean: of two varieties, e.g. black and white, sweet and sour, small and big). He brings the night as a cover over the day. Verily, in these things, there are Ayat (proofs, evidence, lessons, signs, etc.) for people who reflect.

source: وفي الأرض قطع متجاورات وجنات من أعناب وزرع ونخيل صنوان وغير صنوان يسقى بماء واحد ونفضل بعضها على بعض في الأكل إن في ذلك لآيات لقوم يعقلون
en: And in the earth are neighbouring tracts, and gardens of vines, and green crops (fields), and date-palms, growing into two or three from a single stem root, or otherwise (one stem root for every palm), watered with the same water; yet some of them We make more excellent than others to eat. Verily, in these things there are Ayat (proofs, evidence, lessons, signs) for the people who understand.

source: وإن تعجب فعجب قولهم أإذا كنا ترابا أإنا لفي خلق جديد أولئك الذين كفروا بربهم وأولئك الأغلال في أعناقهم وأولئك أصحاب النار هم فيها خالدون
en: And if you (O Muhammad صلى الله عليه و سلم) wonder (at these polytheists who deny your message of Islamic Monotheism and have taken besides Allah others for worship who can neither harm nor benefit), then wondrous is their saying: "When we are dust, shall we indeed then be (raised) in a new creation?" They are those who disbelieved in their Lord! They are those who will have iron chains tying their hands to their necks. They will be the dwellers of the Fire to abide therein.

source: ويستعجلونك بالسيئة قبل الحسنة وقد خلت من قبلهم المثلات وإن ربك لذو مغفرة للناس على ظلمهم وإن ربك لشديد العقاب
en: They ask you to hasten the evil before the good, while (many) exemplary punishments have indeed occurred before them. But verily, your Lord is full of Forgiveness for mankind in spite of their wrong-doing. And verily, your Lord is (also) Severe in punishment.

source: ويقول الذين كفروا لولا أنزل عليه آية من ربه إنما أنت منذر ولكل قوم هاد
en: And the disbelievers say: "Why is not a sign sent down to him from his Lord?" You are only a warner, and to every people there is a guide.

source: الله يعلم ما تحمل كل أنثى وما تغيض الأرحام وما تزداد وكل شيء عنده بمقدار
en: Allah knows what every female bears, and by how much the wombs fall short (of their time or number) or exceed. Everything with Him is in (due) proportion.

source: عالم الغيب والشهادة الكبير المتعال
en: All-Knower of the Unseen and the seen, the Most Great, the Most High.

source: سواء منكم من أسر القول ومن جهر به ومن هو مستخف بالليل وسارب بالنهار
en: It is the same (to Him) whether any of you conceal his speech or declares it openly, whether he be hid by night or goes forth freely by day.

source: له معقبات من بين يديه ومن خلفه يحفظونه من أمر الله إن الله لا يغير ما بقوم حتى يغيروا ما بأنفسهم وإذا أراد الله بقوم سوءا فلا مرد له وما لهم من دونه من وال
en: For him (each person), there are angels in succession, before and behind him. They guard him by the Command of Allah. Verily! Allah will not change the (good) condition of a people as long as they do not change their state (of goodness) themselves (by committing sins and by being ungrateful and disobedient to Allah). But when Allah wills a people's punishment, there can be no turning back of it, and they will find besides Him no protector.

source: هو الذي يريكم البرق خوفا وطمعا وينشئ السحاب الثقال
en: It is He Who shows you the lightning, as a fear (for travellers) and as a hope (for those who wait for rain). And it is He Who brings up (or originates) the clouds, heavy (with water).

source: ويسبح الرعد بحمده والملائكة من خيفته ويرسل الصواعق فيصيب بها من يشاء وهم يجادلون في الله وهو شديد المحال
en: And Ar-Ra'd (thunder) glorifies and praises Him, and so do the angels because of His Awe. He sends the thunderbolts, and therewith He strikes whom He wills, yet they (disbelievers) dispute about Allah. And He is Mighty in strength and Severe in punishment.

source: له دعوة الحق والذين يدعون من دونه لا يستجيبون لهم بشيء إلا كباسط كفيه إلى الماء ليبلغ فاه وما هو ببالغه وما دعاء الكافرين إلا في ضلال
en: For Him (Allah, Alone) is the Word of Truth (i.e. none has the right to be worshipped but Allah). And those whom they (polytheists and disbelievers) invoke, answer them no more than one who stretches forth his hand (at the edge of a deep well) for water to reach his mouth, but it reaches him not; and the invocation of the disbelievers is nothing but an error (i.e. of no use).

source: ولله يسجد من في السماوات والأرض طوعا وكرها وظلالهم بالغدو والآصال
en: And unto Allah (Alone) falls in prostration whoever is in the heavens and the earth, willingly or unwillingly, and so do their shadows in the mornings and in the afternoons.

source: قل من رب السماوات والأرض قل الله قل أفاتخذتم من دونه أولياء لا يملكون لأنفسهم نفعا ولا ضرا قل هل يستوي الأعمى والبصير أم هل تستوي الظلمات والنور أم جعلوا لله شركاء خلقوا كخلقه فتشابه الخلق عليهم قل الله خالق كل شيء وهو الواحد القهار
en: Say (O Muhammad صلى الله عليه و سلم): "Who is the Lord of the heavens and the earth?" Say: "(It is) Allah." Say: "Have you then taken (for worship) Auliya' (protectors) other than Him, such as have no power either for benefit or for harm to themselves?" Say: "Is the blind equal to the one who sees? Or darkness equal to light? Or do they assign to Allah partners who created the like of His creation, so that the creation (which they made and His creation) seemed alike to them?" Say: "Allah is the Creator of all things; and He is the One, the Irresistible."

source: أنزل من السماء ماء فسالت أودية بقدرها فاحتمل السيل زبدا رابيا ومما يوقدون عليه في النار ابتغاء حلية أو متاع زبد مثله كذلك يضرب الله الحق والباطل فأما الزبد فيذهب جفاء وأما ما ينفع الناس فيمكث في الأرض كذلك يضرب الله الأمثال
en: He sends down water (rain) from the sky, and the valleys flow according to their measure, but the flood bears away the foam that mounts up to the surface - and (also) from that (ore) which they heat in the fire in order to make ornaments or utensils, rises a foam like unto it, thus does Allah (by parables) show forth truth and falsehood . Then, as for the foam it passes away as scum upon the banks, while that which is for the good of mankind remains in the earth. Thus Allah sets forth parables (for the truth and falsehood, i.e. Belief and disbelief).

source: للذين استجابوا لربهم الحسنى والذين لم يستجيبوا له لو أن لهم ما في الأرض جميعا ومثله معه لافتدوا به أولئك لهم سوء الحساب ومأواهم جهنم وبئس المهاد
en: For those who answered their Lord's Call [believed in the Oneness of Allah and followed His Messenger Muhammad صلى الله عليه و سلم i.e. Islamic Monotheism] is Al-Husna (i.e. Paradise). But those who answered not His Call (disbelieved in the Oneness of Allah and followed not His Messenger Muhammad صلى الله عليه و سلم), if they had all that is in the earth together with its like, they would offer it in order to save themselves (from the torment, but it will be in vain). For them there will be the terrible reckoning. Their dwelling-place will be Hell; and worst indeed is that place for rest.

source: أفمن يعلم أنما أنزل إليك من ربك الحق كمن هو أعمى إنما يتذكر أولو الألباب
en: Shall he then who knows that what has been revealed unto you (O Muhammad صلى الله عليه و سلم) from your Lord is the truth be like him who is blind? But it is only the men of understanding that pay heed.

source: الذين يوفون بعهد الله ولا ينقضون الميثاق
en: Those who fulfil the Covenant of Allah and break not the Mithaq (bond, treaty, covenant).

source: والذين يصلون ما أمر الله به أن يوصل ويخشون ربهم ويخافون سوء الحساب
en: And those who join that which Allah has commanded to be joined (i.e. they are good to their relatives and do not sever the bond of kinship), and fear their Lord, and dread the terrible reckoning (i.e. abstain from all kinds of sins and evil deeds which Allah has forbidden and perform all kinds of good deeds which Allah has ordained).

source: والذين صبروا ابتغاء وجه ربهم وأقاموا الصلاة وأنفقوا مما رزقناهم سرا وعلانية ويدرءون بالحسنة السيئة أولئك لهم عقبى الدار
en: And those who remain patient, seeking their Lord's Countenance, perform As-Salat (Iqamat-as-Salat), and spend out of that which We have bestowed on them, secretly and openly, and defend evil with good, for such there is a good end.

source: جنات عدن يدخلونها ومن صلح من آبائهم وأزواجهم وذرياتهم والملائكة يدخلون عليهم من كل باب
en: 'Adn (Eden) Paradise (everlasting Gardens), which they shall enter and (also) those who acted righteously from among their fathers, and their wives, and their offspring. And angels shall enter unto them from every gate (saying):

source: سلام عليكم بما صبرتم فنعم عقبى الدار
en: "Salamun 'Alaikum (peace be upon you) for you persevered in patience! Excellent indeed is the final home!"

source: والذين ينقضون عهد الله من بعد ميثاقه ويقطعون ما أمر الله به أن يوصل ويفسدون في الأرض أولئك لهم اللعنة ولهم سوء الدار
en: And those who break the Covenant of Allah, after its ratification, and sever that which Allah has commanded to be joined (i.e. they sever the bond of kinship and are not good to their relatives), and work mischief in the land, on them is the curse (i.e. they will be far away from Allah's Mercy), and for them is the unhappy (evil) home (i.e. Hell) .

source: الله يبسط الرزق لمن يشاء ويقدر وفرحوا بالحياة الدنيا وما الحياة الدنيا في الآخرة إلا متاع
en: Allah increases the provision for whom He wills, and straitens (it for whom He wills), and they rejoice in the life of the world, whereas the life of this world as compared with the Hereafter is but a brief passing enjoyment.

source: ويقول الذين كفروا لولا أنزل عليه آية من ربه قل إن الله يضل من يشاء ويهدي إليه من أناب
en: And those who disbelieved say: "Why is not a sign sent down to him (Muhammad صلى الله عليه و سلم) from his Lord?" Say: "Verily, Allah sends astray whom He wills and guides unto Himself those who turn to Him in repentance."

source: الذين آمنوا وتطمئن قلوبهم بذكر الله ألا بذكر الله تطمئن القلوب
en: Those who believed (in the Oneness of Allah - Islamic Monotheism), and whose hearts find rest in the remembrance of Allah: verily, in the remembrance of Allah do hearts find rest .

source: الذين آمنوا وعملوا الصالحات طوبى لهم وحسن مآب
en: Those who believed (in the Oneness of Allah - Islamic Monotheism), and work righteousness, Tuba (all kinds of happiness or name of a tree in Paradise) is for them and a beautiful place of (final) return.

source: كذلك أرسلناك في أمة قد خلت من قبلها أمم لتتلو عليهم الذي أوحينا إليك وهم يكفرون بالرحمن قل هو ربي لا إله إلا هو عليه توكلت وإليه متاب
en: Thus have We sent you (O Muhammad صلى الله عليه و سلم) to a community before whom other communities have passed away, in order that you might recite unto them what We have revealed to you, while they disbelieve in the Most Gracious (Allah) Say: "He is my Lord! La ilaha illa Huwa (none has the right to be worshipped but He)! In Him is my trust, and to Him will be my return with repentance."

source: ولو أن قرآنا سيرت به الجبال أو قطعت به الأرض أو كلم به الموتى بل لله الأمر جميعا أفلم ييأس الذين آمنوا أن لو يشاء الله لهدى الناس جميعا ولا يزال الذين كفروا تصيبهم بما صنعوا قارعة أو تحل قريبا من دارهم حتى يأتي وعد الله إن الله لا يخلف الميعاد
en: And if there had been a Qur'an with which mountains could be moved (from their places), or the earth could be cloven asunder, or the dead could be made to speak (it would not have been other than this Qur'an). But the decision of all things is certainly with Allah. Have not then those who believed yet known that had Allah willed, He could have guided all mankind? And a disaster will not cease to strike those who disbelieved because of their (evil) deeds or it (i.e. the disaster) settles close to their homes, until the Promise of Allah comes to pass. Certainly, Allah breaks not His Promise.
